Revit 2024 API
AlignmentStationLabel.Station Property
 The alignment station at which the SpotDimension is placed.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public double Station { get; set; }
Visual Basic
Public Property Station As Double
	Get
	Set
Visual C++
public:
property double Station {
	double get ();
	void set (double value);
}
See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace